Revit 2017 API
ExternalServices.BuiltInExternalServices.DirectContext3DService Property
 The external service supporting drawing not Revit models using third party API.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public static ExternalServiceId DirectContext3DService { get; }
Visual Basic
Public Shared ReadOnly Property DirectContext3DService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ DirectContext3DService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace